Revit 2027 API
BuiltInFailures.SketchFailures.SketchFailurePlanes Property
 Sketch is no longer parallel to its defining plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchFailurePlanes { get; }
Public Shared ReadOnly Property SketchFailurePlanes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchFailurePlanes {
	FailureDefinitionId^ get ();
}
static member SketchFailurePlanes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace